Make sure to set the config options in your `neo4j.conf`

.Neo4j.conf

----
apoc.export.file.enabled=true
----

// tag::export.json[]
`YIELD file, source, format, nodes, relationships, properties, time, rows`
[cols="1m,5"]
|===
| apoc.export.json.query(query,file,config) | exports results from the Cypher statement as Json to the provided file
| apoc.export.json.all(file,config) | exports whole database as Json to the provided file
| apoc.export.json.data(nodes,rels,file,config) | exports given nodes and relationships as Json to the provided file
| apoc.export.json.graph(graph,file,config) | exports given graph object as Json to the provided file
|===
// end::export.json[]
== Examples

For the example show below we create this set of data.

[source,cypher]
----
CREATE (f:User {name:'foo',age:42,male:true,kids:['a','b','c']})-[:KNOWS]->(b:User {name:'bar',age:42}),(c:User {age:12})
----

.Export query

[source,cypher]
----
CALL apoc.export.json.query("MATCH (u:User) return u.age, u.name, u.male, u.kids, labels(u)",file,config)
----

result:

[source,json]
----
[ {
  "u.age" : "42",
  "u.name" : "foo",
  "u.male" : "true",
  "u.kids" : [ "a", "b", "c" ],
  "labels(u)" : "[User]"
}, {
  "u.age" : "42",
  "u.name" : "bar",
  "labels(u)" : "[User]"
}, {
  "u.age" : "12",
  "labels(u)" : "[User]"
} ]
----

.Export all

[source,cypher]
----
CALL apoc.export.json.all(file,config)
----

result:

[source,json]
----
[ {
  "id" : 0,
  "labels" : [ "User" ],
  "properties" : {
    "name" : "foo",
    "age" : "42",
    "male" : "true",
    "kids" : [ "a", "b", "c" ]
  },
  "relationships" : [ "(0)-[KNOWS,0]->(1)" ]
}, {
  "id" : 1,
  "labels" : [ "User" ],
  "properties" : {
    "name" : "bar",
    "age" : "42"
  },
  "relationships" : [ "(0)-[KNOWS,0]->(1)" ]
}, {
  "id" : 2,
  "labels" : [ "User" ],
  "properties" : {
    "age" : "12"
  },
  "relationships" : [ ]
}, {
  "id" : 0,
  "type" : "KNOWS",
  "start_node_id" : 0,
  "end_node_id" : 1
} ]
----

.Export graph

[source,cypher]
----
CALL apoc.export.json.graph(graph,file,config)
----

result:

[source,json]
----
[ {
  "id" : 0,
  "labels" : [ "User" ],
  "properties" : {
    "name" : "foo",
    "age" : "42",
    "male" : "true",
    "kids" : [ "a", "b", "c" ]
  },
  "relationships" : [ "(0)-[KNOWS,0]->(1)" ]
}, {
  "id" : 1,
  "labels" : [ "User" ],
  "properties" : {
    "name" : "bar",
    "age" : "42"
  },
  "relationships" : [ "(0)-[KNOWS,0]->(1)" ]
}, {
  "id" : 2,
  "labels" : [ "User" ],
  "properties" : {
    "age" : "12"
  },
  "relationships" : [ ]
}, {
  "id" : 0,
  "type" : "KNOWS",
  "start_node_id" : 0,
  "end_node_id" : 1
} ]
----

.Export data

[source,cypher]
----
MATCH (nod:User)
MATCH ()-[rels:KNOWS]->()
WITH collect(nod) as a, collect(rels) as b
CALL apoc.export.json.data(a, b, {file}, null)
YIELD nodes, relationships, properties, file, source,format, time
RETURN *
----

result:

[source,json]
----
[ {
  "id" : 0,
  "labels" : [ "User" ],
  "properties" : {
    "name" : "foo",
    "age" : "42",
    "male" : "true",
    "kids" : [ "a", "b", "c" ]
  },
  "relationships" : [ "(0)-[KNOWS,0]->(1)" ]
}, {
  "id" : 1,
  "labels" : [ "User" ],
  "properties" : {
    "name" : "bar",
    "age" : "42"
  },
  "relationships" : [ "(0)-[KNOWS,0]->(1)" ]
}, {
  "id" : 2,
  "labels" : [ "User" ],
  "properties" : {
    "age" : "12"
  },
  "relationships" : [ ]
}, {
  "id" : 0,
  "type" : "KNOWS",
  "start_node_id" : 0,
  "end_node_id" : 1
} ]
----